[
  { "id":  1, "name": "Batman", "realName": "Bruce Wayne", "bio": "When his parents were gunned down in front of him, young Bruce Wayne resolved to rid Gotham City of the criminal element that took their lives. He trained extensively to achieve mental and physical perfection, in addition to mastering martial arts, detective techniques, and criminal psychology. When he returned, he was inspired by a bat in his ancestral home of Wayne Manor. He became Batman.", "image": "batman.jpg" },
  { "id":  2, "name": "The Joker", "realName": "Unknown", "bio": "An insanely homicidal super-villain, the Joker's white skin, green hair and blood red lips belie the chaotic nature underlying his cartoonish appearance. The extremely intelligent, self-styled Clown Prince of Crime has no super powers beyond a capacity for incredible violence and a skill at creating deadly mayhem. He frequently concocts elaborate schemes to entrap his arch nemesis, Batman.", "image": "joker.jpg" },
  { "id":  3, "name": "Harley Quinn", "realName": "Harleen Frances Quinzel", "bio": "A Blackgate Prison and Arkham Asylum psychiatrist initially assigned to treat the Joker, Dr. Harleen Quinzel instead became fixated on her patient, believing herself to be in love with him. She helped him escape from confinement and took on her own criminal identity as Harley Quinn. Quinn is a violent and unpredictable felon whose only motivation, beyond general mayhem, is achieving the Joker’s approval. Because of his cruel and mercurial nature, this in some ways makes her just another one of his victims - albeit a very dangerous one.", "image": "harleyquinn.png" },
  { "id": 4, "name": "Catwoman", "realName": "Selina Kyle", "bio": "Selina Kyle, also known by her alias Catwoman, was an orphan who learned to survive on Gotham City's streets. She took to thievery to survive, but was determined to do it in her own style. She learned martial arts and trained extensively to perfect her own skills at cat burglary. Her criminal activities are often tempered by a reluctant altruism, making her an inconstant villain and occasional heroine. She steals objects with feline names or motifs. She regularly eludes capture by the Dark Knight, and maintains a complicated, adversarial relationship with Batman that frequently turns flirtatious and occasionally romantic. Both of them are strong allies.", "image": "catwoman.png" },
  { "id": 5, "name": "Riddler", "realName": "Edward Nashton", "bio": "With an obsessive need for attention and genius-level intellect, Edward Nigma (formerly Edward Nashton) is determined to be the most outlandish of Gotham City's criminals, concocting elaborate series of clues and riddles around his crimes. Batman has proven a worthy opponent, capable of deducing the Riddler's plans, but Nigma is dedicated to creating a mystery the Dark Knight will not be able to solve in time to save the hostages.", "image": "riddler.png" },
  { "id": 6, "name": "The Penguin", "realName": "Oswald Chesterfield Cobblepot", "bio": "A brutal and sadistic crime lord, Oswald Chesterfield Cobblepot is known in the Gotham City Underworld as The Penguin and funds much of its criminal operations as one of its biggest black market manufactures. Directing his affairs from a dilapidated ship, the Final Offer, Oswald was seen as a reputable business man to the people of Gotham, but was a sadistic, mass murdering gang leader in reality. Having recently began to accumulate his power within Gotham City's criminal underworld, Cobblepot began to build up his own forces and carve up a piece of the black market for his own profits and purposes. Forming an alliance with Black Mask, the most powerful and sadistic crime lord in the entire city, who has put a $50 million bounty on Batman himself, the Penguin seeks to crumble his competition, particularly the Falcone Crime Family and aid in killing the Dark Knight in order to consolidate his own power over the city.", "image": "penguin.jpg" },
  { "id": 7, "name": "Bane", "realName": "Peno Dura", "bio": "Imprisoned from birth to serve his dead father's sentence, Bane was raised inside the horrific environs of a Santa Prisca prison. Subjected to military experiments with the experimental ultra-steroid Venom, his superhuman strength and iron-forged will helped him to escape. Determined to build a criminal empire, he sought out Batman and broke the Dark Knight's spine.  But Batman recovered and managed to best Bane, cutting off Bane's precious Venom supply.", "image": "bane.jpg" },
  { "id": 8, "name": "Robin", "realName": "Tim Drake", "bio": "Tim Drake was in the audience the night the Flying Graysons were murdered, where he witnessed Batman leap to the scene. Inspired by Batman's heroics, Tim closely followed the chronicles of Batman and Robin. Eventually deducing their secret identities using self-taught detective skills, Tim convinced Bruce Wayne and Dick Grayson - now Nightwing - that a new Robin was needed in the the never-ending battle for justice. Tested by the Dark Knight himself with a grueling training regimen, Tim earned the right to become Robin, and has since lived up to the name.", "image": "robin.png" },
  { "id": 9, "name": "Nightwing", "realName": "Richard Grayson", "bio": "Raised by his parents, the Flying Graysons, in a circus, Dick Grayson was trained to be incredibly acrobatic. His parents were killed after criminals failed to extort money from the circus. Dick Grayson was soon adopted by billionaire Bruce Wayne, sharing his secret identity and extensively trained the boy to become Batman's sidekick, the first Robin. After aiding Batman for years, Grayson eventually moved on and become a hero in his own right. As Nightwing, he patrols both Gotham City and Blüdhaven, working with the Dark Knight no longer as an apprentice, but as an ally.", "image": "nightwing.png" },
  { "id": 10, "name": "Alfred", "realName": "Alfred Pennyworth", "bio": "Alfred Pennyworth, after a varied career, was employed as the Wayne family's butler when Bruce Wayne's parents were killed. Alfred raised the young orphan and reluctantly aided him in his quest to become the Batman. His many skills - ranging from cooking to medicine - make him Batman's staunchest ally, along with a formal demeanor that grounds the Dark Knight and deflects those who might otherwise suspect Bruce Wayne's true identity. Alfred has shown that he cares for Bruce as his own son, one sign of this love being Batman's ally. Alfred stayed with his adopted son without hesitation and continued to aid him in his war.", "image": "alfred.png" },
  { "id": 11, "name": "Oracle", "realName": "Barbara Gordon", "bio": "The daughter of Gotham City's Police Commissioner James W. Gordon, Barbara Gordon was forbidden by her overprotective father from joining the GCPD. Instead, she took on the identity of Batgirl and was a crime-fighting partner of Batman for years. But that all ended when the Joker shot her through the spine. Paralyzed from the waist down and using a wheelchair, Barbara adopted the new identity of Oracle, and now aids the Dark Knight with her computer expertise, providing Batman with a constant stream of information in the field to aid his battle against crime.", "image": "oracle.png" },
  { "id": 12, "name": "Commissioner James Gordon", "realName": "James Gordon", "bio": "Police Commissioner James W. Gordon dedicated his career to cleaning up the corruption in the Gotham City Police Department, a goal he has come a long way towards accomplishing. He has been equally tough on crime, and in the pursuit of making Gotham City safe for all its citizens, Gordon has forged an uneasy alliance with Gotham's other top crime fighter, the mysterious vigilante known as Batman.", "image": "gordon.jpg" },
  { "id": 13, "name": "Two-Face", "realName": "Harvey Dent", "bio": "District Attorney Harvey Dent was one of Batman's strongest allies in Gotham City, until a criminal threw acid in Dent's face, hideously scarring him. The wounds fractured his psyche, and he was reborn as a schizoid criminal mastermind, obsessed with duality. His former good-luck charm, a two-headed trick silver dollar, was damaged on one side in the attack, and Dent has seized on it as a reflection of his half-scarred visage. He flips it to decide the fates of his victims. Despite Batman's efforts to reform his former ally, Dent is consumed by his fixation on chance, and his crimes are designed to prove out his diametric philosophy.", "image": "twoface.jpg" },
  { "id": 14, "name": "Poison Ivy", "realName": "Pamela Lillian Isley", "bio": "Botanist Pamela Isley was transformed into a plant-human hybrid by a science experiment gone wrong. With chlorophyll flowing through her veins instead of blood, she developed a toxic touch and a pheromone-fueled talent for seduction. Her crimes have become more ecologically focused as she has increasingly abandoned her human side, identifying more with the natural world. Her unique brand of eco-terrorism often puts her into conflict with Batman, whose iron will usually protects him from her seductive powers. Since her encounter with the Dark Knight on Arkham Island, Ivy has been transferred to Arkham City. Taking refuge in a vine-covered stronghold, Ivy would rather keep humanity away than participate in the gang wars of Arkham City. Her presence would go unnoticed until Catwoman sought her out. There, she began plotting destruction for Gotham. ", "image": "poisonivy.jpg" },
  { "id": 15, "name": "Killer Croc", "realName": "Waylon Jones", "bio": "Waylon Jones, also known as Killer Croc, was one of the eight assassins hired by Black Mask (actually the Joker in disguise) to kill Batman on Christmas Eve. Abandoned to his abusive and alcoholic aunt and abused and bullied his entire life due to his appearance, the result of a genetic disorder he was born with, Jones embraced his animal instincts and violently murders and devours his aunt after finally reaching his breaking point. Joining a traveling circus and adopting the stage name, Killer Croc, Jones bonded with his fellow carnival workers and felt like he had a family for the first time. This came to a tragic end however, when vicious audience members in Gotham City destroyed the carnival and killed all whom Jones felt affection for. Seeking revenge on all humanity for their crimes, Croc began to devour countless individuals to survive, becoming a monster in body and spirit. Driven by hatred and a lust for blood, Croc regularly works with Gotham's various mob organizations as a brutal and cannibalistic hit-man to satisfy his appetite for violence and money. Seeing all humans as selfish and judgmental sacks of flesh, Jones took orders from anyone who could provide him with money and a larger scope of victims. He was 28 years old, 10'5, and weighed 485 pounds by the time of Batman's second year at crime fighting.", "image": "killercroc.jpg" },
  { "id": 16, "name": "Scarecrow", "realName": "Jonathan Crane", "bio": "Taunted and bullied in his youth, Dr. Jonathan Crane vowed to overcome his fears through the study of psychology and biochemistry. Kicked out of his university for experimenting on human subjects, Crane adopted the identity of the Scarecrow and armed himself with a specialized fear-inducing gas that makes a person's deepest fears become frighteningly real. His ongoing criminal reign of terror makes him one of Batman's most psychologically dangerous foes. He will be the main antagonist in the upcoming Batman: Arkham Knight", "image": "scarecrow.jpg" },
  { "id": 17, "name": "Ra's al Ghul", "realName": "Unknown", "bio": "Ra's al Ghul is a radical international Eco-Terrorist who has been around for Hundreds of years. He believes that the evils of humanity are a blight on our planet, and seeks to extinguish them through whatever means he deems necessary. Through an international cabal named the League of Assassins, he manipulates world events to achieve his own ends. This frequently puts him into conflict with the Batman, one of very few adversaries he deems worthy enough of himself, and who he has encouraged to marry his daughter Talia al Ghul. Although most of his power comes from his immense influence, he is also a formidable combatant, having the benefit of many lifetimes worth of experience and accumulated skill. Ra's achieves his immortality through the ancient Lazarus Pits. His name literally translates to Demon's Head, or Head of the Demon. It is unconfirmed if he is or is not dead after the events of Arkham City.", "image": "rasalghul.png" }
]